Revit 2027 API
AssemblyInstance.GetTransform Method
 Gets the origin of the assembly instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform GetTransform()
Public Function GetTransform As Transform
public:
Transform^ GetTransform()
member GetTransform : unit -> Transform
Return Value
Transform
 The origin of the assembly instance.
See Also
Reference
AssemblyInstance Class
Autodesk.Revit.DB Namespace